package com.jiangbo.user.mashibing.jvm;

/**
 * TestJdk7Perm
 *
 * @author chengjiangbo@shandiantech.com
 * @version 1.0.0
 * @date 2021/03/09
 */
public class TestJdk7Perm {


	public static void main(String[] args) {
		for (;;){
			String a = new String ("日前，网通社从官方获得一组坦克300限定版官图。新车正式命名为致敬莫奈限定版，该车采用了专属的“柔情蓝”配色，限量300辆，据悉，该车是在越野版顶配基础上打造的限量款车型，将于3月14日正式上市。" +
					"外观方面，新车整体造型硬朗、肌肉线条明显，粗壮的保险杠配合宽大的进气格栅和两侧高耸的轮眉，整体更具野性。同时，该车头灯组采用圆形设计，中间LED灯带延伸至前翼子板处，末端镀铬装饰片上还有WEY品牌LOGO，视觉冲击力更强。" +
					"坦克300尾灯采用方形小圆角设计，LED灯带为竖置排列且倒车灯点缀其中。同时，在细节中还可以看到尾灯外侧有精致的暗色保护设计，在越野中可以起到一定保护作用" +
					"内饰方面，采用黑色和蓝色两种颜色搭配，同时配有限量标识加持，新车使用圆型空调出风口及方菱形缝线内饰板，12.3英寸互动双联屏可显示海拔、气压、车轮转向显示、天气情况等越野综合信息。" +
					"动力方面，搭载2.0T涡轮增压发动机，最大功率167kW/5500rpm，最大扭矩387N·m/1800-3600rpm。传动系统方面，匹配的是来自ZF纵置8AT变速箱。");
			System.out.println(a);
		}
	}
}
